Import libraries

In [1]:
import pandas as pd
import numpy as np

In [2]:
x1 = np.random.rand(2,5)*10
x1

array([[4.14568952, 5.11953942, 1.60473916, 7.16047071, 8.53798605],
       [4.12698481, 9.1493875 , 8.00978905, 1.35573899, 1.63474379]])

In [3]:
x2 = np.random.rand(2,5)*-1
x2

array([[-0.14039182, -0.47180147, -0.3123458 , -0.07093333, -0.9065627 ],
       [-0.59013339, -0.91551443, -0.26513899, -0.02697387, -0.60744476]])

In [4]:
s1 = pd.Series(x1[0],index = ['a','b','c','d','e'])
s1

a    4.145690
b    5.119539
c    1.604739
d    7.160471
e    8.537986
dtype: float64

In [5]:
s2 = pd.Series(x2[0],index = ['c','d','e','f','g'])
s2

c   -0.140392
d   -0.471801
e   -0.312346
f   -0.070933
g   -0.906563
dtype: float64

In [6]:
pd.concat([s1,s2], axis=1)

          0         1
a  4.145690       NaN
b  5.119539       NaN
c  1.604739 -0.140392
d  7.160471 -0.471801
e  8.537986 -0.312346
f       NaN -0.070933
g       NaN -0.906563

In [7]:
pd.concat([s1.reset_index(drop=True),s2.reset_index(drop=True)], axis=1)

          0         1
0  4.145690 -0.140392
1  5.119539 -0.471801
2  1.604739 -0.312346
3  7.160471 -0.070933
4  8.537986 -0.906563

In [8]:
df1 = pd.DataFrame(np.random.rand(3,2)*10,columns=['a','b'])
df1

          a         b
0  7.327700  1.220311
1  7.046561  9.420938
2  5.982943  8.487125

In [9]:
df2 = pd.DataFrame(np.random.rand(3,2)*-1,columns=['a','b'], index = [2,3,4])
df2

          a         b
2 -0.053313 -0.154391
3 -0.770880 -0.114669
4 -0.067845 -0.675458

In [10]:
pd.concat([df1,df2])

          a         b
0  7.327700  1.220311
1  7.046561  9.420938
2  5.982943  8.487125
2 -0.053313 -0.154391
3 -0.770880 -0.114669
4 -0.067845 -0.675458

In [11]:
pd.concat([df1,df2], axis=1)

          a         b         a         b
0  7.327700  1.220311       NaN       NaN
1  7.046561  9.420938       NaN       NaN
2  5.982943  8.487125 -0.053313 -0.154391
3       NaN       NaN -0.770880 -0.114669
4       NaN       NaN -0.067845 -0.675458

In [12]:
pd.concat([df1,df2], axis=1, join='inner')

          a         b         a         b
2  5.982943  8.487125 -0.053313 -0.154391

In [13]:
pd.concat([
           df1.reset_index(drop=True),
           df2.reset_index(drop=True)
           ], axis=1)

          a         b         a         b
0  7.327700  1.220311 -0.053313 -0.154391
1  7.046561  9.420938 -0.770880 -0.114669
2  5.982943  8.487125 -0.067845 -0.675458

In [14]:
df1.append(df2).append(df2)

<ipython-input-14-1a9fb7d15fbe>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2).append(df2)
<ipython-input-14-1a9fb7d15fbe>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2).append(df2)

          a         b
0  7.327700  1.220311
1  7.046561  9.420938
2  5.982943  8.487125
2 -0.053313 -0.154391
3 -0.770880 -0.114669
4 -0.067845 -0.675458
2 -0.053313 -0.154391
3 -0.770880 -0.114669
4 -0.067845 -0.675458

In [15]:
df1.T

          0         1         2
a  7.327700  7.046561  5.982943
b  1.220311  9.420938  8.487125

In [16]:
df1.T.append(df2.T).T

<ipython-input-16-e7a2437070ec>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.T.append(df2.T).T

          a         b         a         b
0  7.327700  1.220311       NaN       NaN
1  7.046561  9.420938       NaN       NaN
2  5.982943  8.487125 -0.053313 -0.154391
3       NaN       NaN -0.770880 -0.114669
4       NaN       NaN -0.067845 -0.675458